Repository: SandraDiaz22/TFG_TremorTrack
Catalog: App/translations/*/LC_MESSAGES/messages.po
Languages: es, fr

source: Error 404 - Página no encontrada
es: Error 404 - Page not found
fr: Erreur 404 - Page non trouvée

source: ¡Ups! Parece que has llegado a un lugar inexplorado. Vamos a buscar un lugar mejor para ti.
es: Oops! It looks like you've reached an unexplored place. Let's find a better place for you.
fr: Oops ! Il semble que vous êtes arrivé dans un endroit inexploré. Nous allons chercher un meilleur endroit pour vous.

source: Ir a la página principal
es: Go to the main page
fr: Aller à la page principale

source: Bienvenido
es: Welcome
fr: Bienvenue

source: Bienvenido de nuevo administrador
es: Welcome back, administrator
fr: Bon retour, administrateur

source: Cerrar sesión
es: Log out
fr: Déconnexion

source: Gestión de usuarios
es: User management
fr: Gestion des utilisateurs

source: Bienvenido de nuevo
es: Welcome back
fr: Bon retour

source: Mostrar listado pacientes
es: Show patient list
fr: Afficher la liste des patients

source: Nombre Completo:
es: Full Name:
fr: Nom complet :

source: Médico Asignado:
es: Assigned Doctor:
fr: Médecin assigné :

source: Sensor:
fr: Capteur :

source: Sí
es: Yes
fr: Oui

source: No
fr: Non

source: Lateralidad:
es: Laterality:
fr: Latéralité :

source: Diestro
es: Right-handed
fr: Droitier

source: Zurdo
es: Left-handed
fr: Gaucher

source: Fecha de Nacimiento:
es: Date of Birth:
fr: Date de naissance :

source: Dirección:
es: Address:
fr: Adresse :

source: Teléfono:
es: Phone number:
fr: Téléphone :

source: Editar datos personales
es: Edit personal data
fr: Modifier les données personnelles

source: Guardar cambios
es: Save changes
fr: Enregistrer les modifications

source: Cancelar
es: Cancel
fr: Annuler

source: Revisar mi evolución
es: Review my progress
fr: Revoir mon évolution

source: Mostrar vídeos
es: Show videos
fr: Afficher les vidéos

source: No hay cambios para guardar.
es: No changes to save.
fr: Aucun changement à enregistrer.

source: Los datos se han actualizado correctamente
fr: Les données ont été mises à jour avec succès

source: Error al editar los datos
fr: Erreur lors de la modification des données

source: El teléfono debe contener exactamente 9 números.
es: The phone number must contain exactly 9 digits.
fr: Le numéro de téléphone doit contenir exactement 9 chiffres.

source: La fecha de nacimiento debe estar entre
es: The date of birth must be between
fr: La date de naissance doit être comprise entre

source: y
fr: et

source: La dirección es demasiado larga.
es: The address is too long.
fr: Le adresse est trop longue.

source: La dirección tiene caracteres no permitidos.
es: The address contains invalid characters.
fr: Le adresse contient des caractères non autorisés.

source: Contacto
es: Contact
fr: Contact

source: Conócenos
es: Get to know us
fr: Faites connaissance avec nous

source: ¡Hola!
es: Hello!
fr: Bonjour !

source: Mi nombre es Sandra, soy estudiante de Ingeniería Informática en la Universidad de Burgos y, junto con mi tutor Álvar Arnaiz, hemos credo esta aplicación web.
es: My name is Sandra, I am a Computer Engineering student at the University of Burgos, and together with my tutor Álvar Arnaiz, we have created this web application.
fr: Je me nomme Sandra, je suis étudiante en génie informatique à le Université de Burgos et, avec mon tuteur Álvar Arnaiz, nous avons créé cette application web.

source: Este proyecto forma parte de mi trabajo de fin de grado y espero que sea de utilidad a muchas personas.
es: This project is part of my final degree work, and I hope it will be useful to many people.
fr: Ce projet fait partie de mon mémoire de fin et je souhaite que ce soit utile à de nombreuses personnes.

source: Trabajamos junto con la Asociación de Parkinson de Burgos para hacer un poco más fácil la vida de las personas que sufren esta enfermedad.
es: We work together with the Parkinson Association of Burgos to make life a little easier for people suffering from this disease.
fr: Nous travaillons avec le Association de Parkinson de Burgos pour rendre la vie des personnes atteintes de cette maladie un peu plus facile.

source: Contacta con nosotros
es: Contact us
fr: Contactez-nous

source: Preguntas y consultas
es: Questions and inquiries
fr: Questions et consultations

source: Puedes enviarnos tus preguntas y consultas a través de nuestros correos electrónicos:
es: You can send us your questions and inquiries through our email addresses:
fr: Vous pouvez nous envoyer vos questions et consultations par e-mail :

source: Ubicación
es: Location
fr: Emplacement

source: Encuéntranos en:
es: Find us at:
fr: Trouvez-nous à :

source: © OpenStreetMap contributors
fr: © contributeurs OpenStreetMap

source: Avenida Cantabria, s/n, 09006 Burgos (España)
es: Avenida Cantabria, s/n, 09006 Burgos (Spain)
fr: Avenida Cantabria, s/n, 09006 Burgos (Espagne)

source: Gestión Usuarios
es: User Management
fr: Gestion des utilisateurs

source: Gestión de Usuarios
fr: Gestion des utilisateurs

source: Elige la tabla a gestionar:
es: Choose the table to manage:
fr: Choisissez la table à gérer :

source: Administradores
es: Administrators
fr: Administrateurs

source: Médicos
es: Doctors
fr: Médecins

source: Pacientes
es: Patients
fr: Patients

source: Nombre:
es: Name:
fr: Nom :

source: Apellido:
es: Last Name:
fr: Prénom :

source: Nombre de Usuario:
es: Username:
fr: Nom de utilisateur :

source: Contraseña:
es: Password:
fr: Mot de passe :

source: Correo Electrónico:
es: Email:
fr: Adresse e-mail :

source: Foto:
es: Photo:
fr: Photo :

source: ¿Tiene Sensor?
es: Has Sensor?
fr: A-t-il un capteur ?

source: Agregar Usuario
es: Add User
fr: Ajouter un utilisateur

source: Tabla de Administradores
es: Administrator Table
fr: Table des administrateurs

source: Añadir Administrador
es: Add Administrator
fr: Ajouter un administrateur

source: Nombre
es: Name
fr: Nom

source: Foto
es: Photo
fr: Photo

source: Acciones
es: Actions
fr: Actions

source: Editar usuario
es: Edit user
fr: Modifier utilisateur

source: Eliminar Usuario
es: Delete User
fr: Supprimer utilisateur

source: Nombre de usuario:
es: Username:
fr: Nom de utilisateur :

source: Correo electrónico:
es: Email:
fr: Adresse e-mail :

source: Tabla de Médicos
es: Doctor Table
fr: Table des médecins

source: Añadir Médico
es: Add Doctor
fr: Ajouter un médecin

source: Tabla de Pacientes
es: Patient Table
fr: Table des patients

source: Añadir Paciente
es: Add Patient
fr: Ajouter un patient

source: Subir vídeo
es: Upload video
fr: Télécharger une vidéo

source: Archivo de vídeo:
es: Video file:
fr: Fichier vidéo :

source: Fecha del vídeo:
es: Video date:
fr: Date de la vidéo :

source: Mano del vídeo:
es: Hand in video:
fr: Main de la vidéo :

source: Seleccionar
es: Select
fr: Sélectionner

source: Derecha
es: Right
fr: Droite

source: Izquierda
es: Left
fr: Gauche

source: Lentitud:
es: Slowness:
fr: Lenteur :

source: Amplitud:
es: Amplitude:
fr: Amplitude :

source: Subiendo...(esto podría tardar unos minutos)
es: Uploading... (this could take a few minutes)
fr: Téléchargement... (cela peut prendre quelques minutes)

source: Subir datos sensor
es: Upload sensor data
fr: Télécharger les données du capteur

source: Archivo CSV:
es: CSV File:
fr: Fichier CSV :

source: Subir archivo CSV
es: Upload CSV File
fr: Télécharger le fichier CSV

source: Mostrar datos sensor
es: Show sensor data
fr: Afficher les données du capteur

source: Fecha de nacimiento:
es: Date of Birth:
fr: Date de naissance :

source: Por favor, complete todos los campos.
es: Please complete all fields.
fr: Veuillez remplir tous les champs.

source: Error al subir el archivo de vídeo.
es: Error uploading video file.
fr: Erreur lors du téléchargement du fichier vidéo.

source: No puedes eliminarte a ti mismo.
es: You cannot delete yourself.
fr: Vous ne pouvez pas vous supprimer vous-même.

source: ¿Estás seguro de que deseas eliminar este usuario?
es: Are you sure you want to delete this user?
fr: Êtes-vous sûr de vouloir supprimer cet utilisateur ?

source: Usuario eliminado con éxito
es: User successfully deleted
fr: Utilisateur supprimé avec succès

source: No se puede eliminar al médico porque tiene pacientes a su cargo.
fr: Vous ne pouvez pas éliminer le médecin parce que il a des patients sous sa garde.

source: Error al eliminar el usuario
es: Error deleting user
fr: Erreur lors de la suppression de utilisateur

source: Por favor, complete todos los campos obligatorios.
es: Please complete all required fields.
fr: Veuillez remplir tous les champs obligatoires.

source: Usuario agregado correctamente
es: User successfully added
fr: Utilisateur ajouté avec succès

source: Error al agregar el usuario
es: Error adding user
fr: Erreur lors de ajout de utilisateur

source: Usuario editado correctamente
es: User successfully edited
fr: Utilisateur modifié avec succès

source: Error al editar el usuario
es: Error editing user
fr: Erreur lors de la modification de utilisateur

source: El nombre es demasiado largo.
fr: Le nom est trop long.

source: El nombre tiene caracteres no permitidos.
fr: Le nom contient des caractères non autorisés.

source: El apellido es demasiado largo.
fr: Le prénom est trop long.

source: El apellido tiene caracteres no permitidos.
fr: Le prénom contient des caractères non autorisés.

source: El nombre de usuario es demasiado largo.
fr: Le nom de utilisateur est trop long.

source: El nombre de usuario tiene caracteres no permitidos.
fr: Le nom de utilisateur contient des caractères non autorisés.

source: La contraseña es demasiado larga.
fr: Le mot de passe est trop long.

source: La contraseña es demasiado corta.
fr: Le mot de passe est trop court.

source: El ID del médico debe ser un número.
fr: Le ID du médecin doit être un numéro.

source: Logo APP
es: APP Logo
fr: Logo de le application

source: Toggle navigation
fr: Basculer la navigation

source: Idioma
es: Language
fr: Langue

source: Inglés
es: English
fr: Anglais

source: Español
es: Spanish
fr: Espagnol

source: Francés
es: French
fr: Français

source: Perfil
es: Profile
fr: Profil

source: Página principal
es: Home page
fr: Page principale

source: Iniciar sesión
es: Login
fr: Se connecter

source: Listado pacientes
es: Patient list
fr: Liste des patients

source: Listado de Pacientes
fr: Liste des patients

source: Información personal
es: Personal information
fr: Informations personnelles

source: Paciente editado correctamente
es: Patient successfully edited
fr: Patient modifié avec succès

source: Error al editar el paciente
es: Error editing patient
fr: Erreur lors de la modification du patient

source: Login
fr: Connexion

source: Inicio sesión
es: Sign in
fr: Connexion

source: Nombre de usuario
fr: Nom de utilisateur

source: Ingresa tu nombre de usuario
es: Enter your username
fr: Entrez votre nom de utilisateur

source: Contraseña
fr: Mot de passe

source: Ingresa tu contraseña
es: Enter your password
fr: Entrez votre mot de passe

source: Enviar
es: Submit
fr: Envoyer

source: Datos sensor
es: Sensor data
fr: Données du capteur

source: Mostrar Datos Sensor
fr: Afficher les données du capteur

source: Paciente:
es: Patient:
fr: Patient :

source: Selecciona la gráfica a mostrar:
es: Select the graph to display:
fr: Sélectionnez le graphique à afficher :

source: Parámetros de Bradicinesia
es: Bradykinesia parameters
fr: Paramètres de bradykinésie

source: Parámetros de FoG y Discinesia
es: FoG and dyskinesia parameters
fr: Paramètres de FoG et de dyskinésie

source: Información de los pasos
es: Step information
fr: Informations sur les pas

source: Parámetros de Estado Motor, Discinesia y Bradicinesia a 10 min
es: Motor state, dyskinesia, and bradykinesia parameters at 10 min
fr: Paramètres de le état moteur, dyskinésie et bradykinésie à 10 min

source: Selecciona las fechas a mostrar:
fr: Sélectionnez les dates à afficher :

source: Seleciona fechas...
fr: Sélectionnez des dates...

source: Mostrar datos
es: Show data
fr: Afficher les données

source: Fechas disponibles: <br>
es: Available dates: <br>
fr: Dates disponibles : <br>

source: Seleccione un tipo de gráfico.\n
es: Select a type of chart.\n
fr: Sélectionnez un type de graphique.\n

source: Seleccione una fecha.\n
es: Select a date.\n
fr: Sélectionnez une date.\n

source: Vídeos Paciente
es: Patient Videos
fr: Vidéos du patient

source: Mostrar Vídeos
fr: Afficher les vidéos

source: Vídeos paciente:
es: Patient videos:
fr: Vidéos du patient :

source: Título
es: Title
fr: Titre

source: Mano del vídeo
es: Hand in the video
fr: Main de la vidéo

source: Fecha
es: Date
fr: Date

source: Reproducir
es: Play
fr: Lire

source: Eliminar
es: Delete
fr: Supprimer

source: Reproducir vídeo
es: Play video
fr: Lire la vidéo

source: Ocultar vídeo
es: Hide video
fr: Masquer la vidéo

source: Características
es: Characteristics
fr: Caractéristiques

source: Velocidad media:
es: Average speed:
fr: Vitesse moyenne :

source: Frecuencia de máximos:
es: Peak frequency:
fr: Fréquence des maxima :

source: Frecuencia de mínimos:
es: Trough frequency:
fr: Fréquence des minima :

source: Promedio de máximos:
es: Peak average:
fr: Moyenne des maxima :

source: Desviación estándar de máximos:
es: Standard deviation of peaks:
fr: Écart type des maxima :

source: Diferencia ranurada de la frecuencia de mínimos:
es: Smoothed trough frequency difference:
fr: Différence crantée de la fréquence des minima :

source: Diferencia ranurada de la frecuencia de máximos:
es: Smoothed peak frequency difference:
fr: Différence crantée de la fréquence des maxima :

source: Eliminar vídeo
es: Delete video
fr: Supprimer la vidéo

source: Gráficos con las características de los vídeos
es: Charts with video characteristics
fr: Graphiques avec les caractéristiques des vidéos

source: Predecir
es: Predict
fr: Prédire

source: Gráfico mano izquierda
es: Left hand chart
fr: Graphique main gauche

source: Gráfico mano derecha
es: Right hand chart
fr: Graphique main droite

source: Gráfico predicción mano izquierda
es: Left hand prediction chart
fr: Graphique prédiction main gauche

source: Gráfico predicción mano derecha
es: Right hand prediction chart
fr: Graphique prédiction main droite

source: Lentitud
es: Slowness
fr: Lenteur

source: Amplitud
es: Amplitude
fr: Amplitude

source: Velocidad Media
es: Average Speed
fr: Vitesse Moyenne

source: Frecuencia de Máximos
es: Peak Frequency
fr: Fréquence des Maxima

source: Frecuencia de Mínimos
es: Trough Frequency
fr: Fréquence des Minima

source: Promedio de Máximos
es: Peak Average
fr: Moyenne des Maxima

source: Desviación Estándar de Máximos
es: Standard Deviation of Peaks
fr: Écart-Type des Maxima

source: Fechas de los vídeos
es: Video Dates
fr: Dates des vidéos

source: No hay vídeos disponibles para mostrar.
es: No videos available to display.
fr: Aucune vidéo disponible à afficher.

source: ¿Estás seguro de que deseas eliminar este vídeo?
es: Are you sure you want to delete this video?
fr: Êtes-vous sûr de vouloir supprimer cette vidéo ?

source: Vídeo eliminado con éxito
es: Video successfully deleted
fr: Vidéo supprimée avec succès

source: Error al eliminar el vídeo
es: Error deleting video
fr: Erreur lors de la suppression de la vidéo

source: Página Principal
es: Homepage
fr: Page Principale

source: Descubre todo lo que puedes hacer con TremorTrack:
es: Discover all you can do with TremorTrack:
fr: Découvrez tout ce que vous pouvez faire avec TremorTrack :

source: - Realizar el seguimiento de tus datos médicos.
es: - Track your medical data.
fr: - Suivre vos données médicales.

source: - Predecir con IA cómo va a ser tú evolución.
es: - Predict how your evolution will be with AI.
fr: - Prédire avec IA comment va évoluer votre état.

source: - Consultar los datos de tus pacientes.
es: - Consult your patients' data.
fr: - Consulter les données de vos patients.

source: - Realizar predicciones con IA.
es: - Make predictions with AI.
fr: - Faire des prédictions avec IA.

source: - Subir vídeos y datos de tus pacientes.
es: - Upload videos and data from your patients.
fr: - Télécharger des vidéos et des données de vos patients.

source: y
es: and

source: Error al analizar los datos:
es: Error parsing data:

source: No hay datos.
es: No data available.

source: Error al procesar la respuesta:
es: Error processing the response:
